A1=[0 0 0 0 0 0 0 0 
    0 0 0 1 1 1 1 0
    0 0 0 1 1 1 1 0 
    0 1 1 1 1 1 1 0
    0 1 1 1 1 1 1 0
    0 1 1 1 1 0 0 0
    0 1 1 1 1 0 0 0
    0 0 0 0 0 0 0 0];
A2=[0 0 0 0 0 0 0 0
    0 1 1 1 1 1 1 0
    0 1 1 1 1 1 1 0
    0 1 1 0 0 1 1 0
    0 1 1 0 0 1 1 0
    0 1 1 1 1 1 1 0
    0 1 1 1 1 1 1 0
    0 0 0 0 0 0 0 0];
A3=[0 0 0 0 0 0 0 0
    0 0 0 0 0 1 1 0
    0 1 1 1 0 1 1 0
    0 1 1 1 0 1 1 0
    0 1 1 1 0 1 1 0
    0 1 1 1 0 0 0 0
    0 1 1 1 0 0 0 0
    0 0 0 0 0 0 0 0];
B1=[0 1 0
    1 1 1
    0 1 0];
B2=[1 1 1
    1 1 1
    1 1 1];
B3=[1 0 0
    0 0 0
    0 0 1];

td1=imdilate(A1,B1);
td2=imdilate(A2,B2);
td3=imdilate(A3,B3);
% ¿±µÈ

re1=imerode(A1,B1);
re2=imerode(A2,B2);
re3=imerode(A3,B3);
% «I»k

open1=imopen(A1,B1);
open2=imopen(A2,B2);
open3=imopen(A3,B3);
% ¶}±Ò

close1=imclose(A1,B1);
close2=imclose(A2,B2);
close3=imclose(A3,B3);
% Ãö³¬